-- ยกยอดคงเหลือจากปีงบประมาณ 2566 มาปี 2567
-- วันที่ 1 ตุลาคม 2566 = 2023-10-01

INSERT INTO transactions (date, doc_no, description, fund_type, income, expense, payer)
VALUES
  ('2023-10-01', '-', 'ยกยอดมา (เงินอุดหนุนรายหัว) จากปี 2566', 'fund-subsidy', 1459.63, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงินเรียนฟรี 15 ปี - อุปกรณ์การเรียน) จากปี 2566', 'fund-15y-supply', 300.00, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงินเรียนฟรี 15 ปี - เครื่องแบบนักเรียน) จากปี 2566', 'fund-15y-uniform', 900.00, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงินเรียนฟรี 15 ปี - กิจกรรมพัฒนาคุณภาพผู้เรียน) จากปี 2566', 'fund-15y-activity', 28390.00, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงิน กสศ.) จากปี 2566', 'fund-eef', 20071.59, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงินอาหารกลางวัน) จากปี 2566', 'fund-lunch', 125124.46, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงินรายได้แผ่นดิน-ดอกเบี้ย) จากปี 2566', 'fund-state', 322.71, 0, 'ยกยอดจากปีงบ 2566'),
  ('2023-10-01', '-', 'ยกยอดมา (เงินรายได้สถานศึกษา) จากปี 2566', 'fund-school-income', 2903.28, 0, 'ยกยอดจากปีงบ 2566');
